<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');
/*------------------------------语言配置-------------------------------*/

//订单状态
$config['order_status'] = array(
	0 	=> '等待买家付款',
	1 	=> '买家已付款',
	2 	=> '卖家配货中',
	3 	=> '卖家已发货',
	4 	=> '买家已收货',
	5 	=> '已安装',
	6 	=> '订单完成',
	10 	=> '退款退货成功',
	11 	=> '买家已付订金',
	21 	=> '订单取消'
);

//退货退款状态
$config['refund_status'] = array(
	1 	=> '买家申请退货退款',
	2 	=> '买家申请退款',
	3 	=> '买家撤销退款申请',
	4 	=> '商家同意退货，买家退货中',
	5 	=> '买家已退货，商家确认收货中',
	6 	=> '商家收到退货',
	7 	=> '商家拒绝退款',
	8 	=> '商家同意退款',
	9 	=> '退款成功'
);

//订单类型
$config['order_type'] = array(
	0 	=> '普通订单',
	1 	=> '赠品订单',
	2 	=> '团购订单',
	3 	=> '预售订单',
	4 	=> '秒杀订单',
	5 	=> '直购团订单',
	6 	=> '购买优惠券订单',
	7 	=> '全屋购订单'
);

//订单来源
$config['order_be_from'] = array(
	1 	=> 'PC商城',
	2 	=> 'M端',
	3 	=> 'B端'
);

//订单取消原因
$config['order_cancel_reason'] = array(
	1 	=> '过期未支付，系统自动取消',
	2 	=> '现在不想买了',
	3 	=> '别处价格更低',
	4 	=> '需要修改订单商品',
	5 	=> '需要修改配送地址',
	6 	=> '无法网上支付订单',
	10 	=> '其他原因'
);

//商品优惠类型
$config['goods_discount_type'] = array(
	1 	=> '优惠券',
	2 	=> '红包',
	3 	=> '打折',
	4 	=> '满减',
	5 	=> '赠品',
	6 	=> '秒杀',
	7 	=> '团购',
	8 	=> '预售',
	9 	=> '组合优惠'
);

//直购团状态
$config['group_direct_status'] = array(
	0 	=> '未付款',
	1 	=> '报名成功',
	2 	=> '消取'
);

//优惠券类型
$config['coupon_type'] = array(
	1 	=> '平台级',
	2 	=> '品牌商级',
	3 	=> '品牌级',
	4 	=> '分类级',
	5 	=> '商品级'
);

//导购员佣金状态
$config['reward_status'] = array(
	0 	=> '未确认',
	1 	=> '已确认',
	2 	=> '未结算',
	3 	=> '已结算',
	9 	=> '无效'
);

//站点所属区域
$config['site_zone'] = array(
	1 	=> '国内',
	2 	=> '香港'
);





/* End of file config.php */
/* Location: ./application/config/config.php */
